{
  "last_updated": "2025-08-29T08:30:09.668535",
  "total_routes": 178,
  "active_vehicles": 62,
  "status": "active",
  "routes_by_type": {},
  "active_alerts": [
    {
      "id": "435698",
      "title": "Bowdoin Escalator 125 (Lobby to street) is unavailable until further notice.",
      "description": "The escalator will remain out of service for the foreseeable future. This decision was made after a thorough inspection determined that corrosion on the escalator’s steel truss was so severe that it could not be repaired further and that a complete replacement of the escalator would be required. Replacing the escalator at this location requires a more extended unit meeting modern escalator safety requirements. This longer unit will require significant alteration to the station entrance to meet code requirements. The MBTA has currently begun design work to understand what station upgrades will be needed. \r\n  \r\nDue to these complexities, we expect the escalator will remain out of service for a significant time. We recognize the challenges this poses to our riders, and please know we are working to identify a solution as quickly as possible. In the meantime, Government Center Station, which is fully accessible and serves the Blue Line, is under a quarter-mile from Bowdoin Station. \r\n",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "656012",
      "title": "To accommodate Prov Sta Renovations, construction barriers have been installed & the Southern stairwell to Track 1 & 3 is out of service",
      "description": "Affected lines:\r\nProvidence/Stoughton Line\r\nFoxboro (Special Events)",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "416078",
      "title": "Lynn Parking Garage arcade stairs 1 & 2 are closed until further notice. Customers may exit the garage via elevators to the ground level or ",
      "description": "Vehicular access to the upper 2 levels of the garage is restricted. The garage has sufficient parking capacity to accommodate daily demand.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "663187",
      "title": "Forest Hills Elevator 842 (Orange Line platform to main upper lobby) unavailable due to maintenance",
      "description": "To exit, use Forest Hills Elevator 724 located at the opposite end of the platform to access the Southwest Corridor Park lobby. To board, use the Washington St exit, turn right and proceed to the intersection of Washington St and Arborway. Cross Arborway, turn right, then continue to the Southwest Corridor Park entrance and use Forest Hills Elevator 724.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "663140",
      "title": "Sullivan Square Elevator 840 (Center platform to lobby) unavailable due to maintenance",
      "description": "To exit when traveling on a Forest Hills-bound train, exit onto the center platform and wait for an Oak Grove train to arrive. When the train arrives, cross through the train over to the opposite platform and use Sullivan Elevator 881. To exit the train when traveling on an Oak Grove-bound train, exit the right side of the train onto the Oak Grove platform and use Sullivan Elevator 881. To board a Forest Hills-bound train, use Sullivan Elevator 881 to access the Oak Grove platform, then wait for an Oak Grove-bound train to arrive. When the train arrives, cross through the train over to the center platform.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662627",
      "title": "Due to a vessel substitution the Quincy and Winthrop Ferries may experience minor delays at Seaport/Fan Pier through Friday, August 29.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "661698",
      "title": "Rt. 34E detoured. The nearest inb. connections are 710 East St opp Kendall St or Washington St opp Washington Green. The nearest outb. conne",
      "description": "Affected stops:\r\n624 Washington St opp Bird Middle School (inbound)\r\nWashington St @ Pilgrim Way (inbound)\r\nWashington St @ Polley Ln (inbound)",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "652201",
      "title": "Jackson Sq: The stairway connecting the lobby & the south end of the platform is closed. Use the stairway at the north end of the platform.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "639578",
      "title": "Malden Center Escalator 312 (Street level to Commuter Rail platform) unavailable due to maintenance.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "630009",
      "title": "There is no accessible path connecting the inb. & outb. platforms at Wellesley Sq Sta. The existing path includes steep slopes & is long. ",
      "description": "There are accessible mini-high platforms at the Western end of both the Track 1 and Track 2 sides. However, the existing pedestrian path between the two sides is long and includes steep slopes, especially on the Crest Road bridge over the tracks. Designs are underway to provide for a fully compliant pathway. ",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "663207",
      "title": "Porter Elevator 983 (Red Line platforms to lobby) unavailable due to maintenance",
      "description": "Please use nearby Porter Elevator 987 to access the Red Line platforms or lobby.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "660417",
      "title": "Charlestown and East Boston Ferry service will operate until 10 PM on Fridays and Saturdays from August 29 to September 27. ",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662788",
      "title": "Haymarket Elev. 907 unavailable. Please see a station official or use a station call box for a shuttle bus between Haymarket & N Station",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "625935",
      "title": "Littleton/Route 495 passengers can expect occasional traffic and detours accessing the station due to the Foster Street reconstruction work",
      "description": "Scheduled to complete sometime in 2027, the Reconstruction of Foster Street includes widening and resurfacing with the addition of bicycle lanes.  ",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "662527",
      "title": "Route 220 has resumed operating to the Hingham Ferry Terminal. For information on ferry arrival and departure times visit mbta.com/Ferry",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "661030",
      "title": "Park St Elevator 808 (Red Line center platform to Government Center & North platform, Winter St Concourse) unavailable through Sun Oct 5",
      "description": "The elevator will be closed for major equipment upgrades that will significantly improve the long-term reliability of this elevator.\r\n\nTo exit: from the Red Line Center platform, take Park Street Elevator 979 to the Green Line Copley & West platform. Exit faregates. Take Elevator 978 to the Boston Common. \r\n\nTo Red Line: from street level, take Park Street Elevator 978 on the Boston Common to the Green Line Copley & West lobby. Enter faregates. Turn left. Take Elevator 979 to the Red Line center platform. \\n\\n\r\n\nTo Red Line: from Winter St Concourse, go to the end of the Green Line Gov Ctr & North platform. Use Elevator 812. Turn left. Take Elevator 823 to the Copley & West platform. Go to the east end of the platform. Take Elevator 979 to the Red Line center platform.\r\n",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "663136",
      "title": "The Kingston Line online timetable is being updated. View PDF Timetable on the MBTA website.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "662183",
      "title": "Rts. 62 & 76 are now operating as separate Rts., with more frequent service on both. Rt. 62 now runs every day.",
      "description": "Routes 62 & 76: Bedford VA Hospital – Alewife Station, Hanscom Airport, and Lincoln Lab:\r\n\nIf you ride the combined Route 62/76:\r\nThe combined 62/76 route pattern will be discontinued, ending Saturday service to Lincoln Lab and all service on Hartwell Ave in Lexington.\r\n\nFor weekday service between Lexington Center, Hanscom Field, and Lincoln Lab, use Route 76.\r\nFor Saturday service between Lexington Center, Hanscom Field, and Lincoln Lab, use an alternative travel option.\r\nOn Hartwell Ave in Lexington, use Route 62 or an alternative travel option.\r\n\nIf you ride Route 62:\r\nYou'll have more frequent service, every day of the week. There won't be any changes to the route.\r\n\nRoute 62 will run every day, with weekend service on both Saturday and Sunday.\r\nOn weekdays during peak hours (7 – 9 AM and 4 – 6:30 PM), a Route 62 bus will arrive every 30 minutes, compared to 45 minutes today.\r\n\nOn weekdays during peak hours, between Alewife and Lexington Center, a 62 or 76 bus will arrive every 15 – 30 minutes.\r\n\nOn weekends, a Route 62 bus will arrive every 50 minutes, compared to 65 minutes on the 62/76 today. \r\nTrips between the Bedford VA Hospital and Alewife will be 15 – 20 minutes shorter.\r\n\nIf you ride Route 76:\r\nRoute 76 will continue to run on weekdays only, with more frequent service during peak hours (7 – 9 AM and 4 – 6:30 PM). There won't be any changes to the route.\r\n\nDuring peak hours, a Route 76 bus will arrive every 30 minutes, compared to 45 minutes today.\r\nDuring peak hours, between Alewife and Lexington Center, a 62 or 76 bus will arrive every 15 – 30 minutes.\r\nRoute 76 will run new midday and evening service.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "507767",
      "title": "Beginning Fri, Jun 30, the Riverside Ave entrance at Campello Station will be closed.",
      "description": "Affected lines:\r\nFall River/New Bedford Line",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "662748",
      "title": "Route 435 detoured due to construction. The nearest outbound connections are Neptune Blvd @ Blossom St and Lynn Station.",
      "description": "Affected direction: Outbound\r\n\nAffected stops:\r\nTremont St opp St Mary's High School\r\nMarket St @ Tremont St",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "662747",
      "title": "Route 429 detoured due to construction. The nearest outbound connections are Lynn Station and Market St @ Liberty St.",
      "description": "Affected direction: Outbound\r\n\nAffected stops:\r\nOxford St @ Washington St\r\nOxford St @ Market St",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "662142",
      "title": "At Alewife, Route 350 inbound has moved down one berth and is now boarding at Berth B4.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662789",
      "title": "Rts. 450 & 456 detoured from Thu, Aug 28, to Thu, Sep 4, between 7am & 4pm. Inb. connections are available at Salem & Essex St opp Warren St",
      "description": "Affected stops:\r\nEssex St @ Beckford St (inbound)\r\nEssex St @ Flint St (inbound)\r\nEssex St @ Flint St (outbound)\r\nEssex St @ Hamilton st (outbound)\r\nEssex St @ Monroe St (inbound)\r\nEssex St @ Summer St (outbound)\r\nEssex St opp Monroe St (outbound)\r\nNorth St @ Essex St (inbound)\r\nWashington St @ Church St (outbound)\r\nWashington St @ New Derby St (outbound)",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "490115",
      "title": "Andrew Escalator 123 (Ashmont/Braintree platform to busway) is unavailable until further notice pending replacement.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662145",
      "title": "At Alewife, Route 67 inbound has moved down one berth and is now boarding at Berth B3.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662116",
      "title": "The Chestnut Hill Lot will be closed from Wed, Aug 27, through Fri, Sep 12. Alternative parking is available at Waban, Eliot, or Riverside.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "658350",
      "title": "Ruggles Escalator 136 (Orange Line platform to upper lobby) unavailable",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662917",
      "title": "As of Mon, Aug 25, further schedule adjustments will be implemented on the Fairmount Ln reflecting the progress made by Amtrak repairs",
      "description": "Planned infrastructure improvements to prepare the Fairmount Line for battery-electric trains while Amtrak repairs will continue.\r\n\nFuture adjustments to service can be expected as Amtrak makes progress on repairs, with the goal of returning to normal Commuter Rail service for passengers as soon as possible.",
      "severity": 8,
      "route_id": "unknown"
    },
    {
      "id": "663137",
      "title": "The Greenbush Line online timetable is being updated. View PDF Timetable on the MBTA website. ",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "652726",
      "title": "Hynes Convention Center Esc. 315 (Kenmore & West platform to paid lobby) unavailable from Mon Aug 11 through Fri Aug 29 due to maintenance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "635231",
      "title": "S Station Pedal & Park is closed. Bicycle racks are currently available on Atlantic Ave adjacent to the S Station main entrance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "663012",
      "title": "Quincy Ferry: Due to a vessel substitution, the Quincy Ferry will not service the Seaport stop on Thursday and Friday.",
      "description": "Affected stops:\r\nSeaport/Fan Pier",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "390224",
      "title": "Courthouse Escalator 417 (Airport/Design Center platform to south lobby) unavailable due to maintenance",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "652202",
      "title": "Jackson Sq: The platform is undergoing renovations until fall 2025 to improve safety & accessibility. ",
      "description": "Please see station personnel or use a station call box to request assistance.",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "655098",
      "title": "George's Island will remain closed this season due to waterline repairs.",
      "description": "Affected routes:\r\nHingham/Hull Ferry",
      "severity": 10,
      "route_id": "unknown"
    },
    {
      "id": "662147",
      "title": "At Alewife, Route 76 inbound has moved down two berths and is now boarding at Berth B1.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "659683",
      "title": "Please board Prov Line Train 802 on the outbound platform at Pawtucket/Central Falls & S Attleboro on weekdays until further notice",
      "description": "Affected direction: Inbound\r\n\nAffected stops:\r\nPawtucket/Central Falls\r\nSouth Attleboro\r\n\nAffected trips:\r\n802 (4:12 am from Providence)\r\n",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "651836",
      "title": "Assembly Escalator 442 (Foley Street to unpaid lobby) unavailable due to maintenance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "634987",
      "title": "State Escalator 6 (Oak Grove platform to Old State House lobby) unavailable",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "390223",
      "title": "Courthouse Escalator 415 (Airport/Design Center platform to lobby) unavailable due to ongoing construction at the station. ",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "658919",
      "title": " All inb. Franklin/Foxboro trains will continue to bypass Forest Hills, Ruggles & Back Bay. Shuttle buses no longer replace trains between F",
      "description": "Affected direction: Inbound\r\n\nInbound Franklin/Foxboro Line passengers traveling to Forest Hills, Ruggles, or Back Bay may:\r\n- Transfer to a Providence Line train at Readville (Track 4)\r\n- Stay on inbound Franklin/Foxboro train to South Station then transfer to an outbound train or the subway.\r\n\nBeginning on Monday, August 25th, normal train service resumes between Franklin and Forge Park/495. ",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "661599",
      "title": "Construction is ongoing in the Hingham Parking lot & on Shipyard Dr in preparation for the Hingham Ferry Dock upgrades. ",
      "description": null,
      "severity": 10,
      "route_id": "unknown"
    },
    {
      "id": "661398",
      "title": "Haymarket Elev. 903 unavailable. Please see a station official or use a station call box for a shuttle bus between Haymarket & N Station",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "635973",
      "title": "Construction is ongoing in the Hingham Parking lot & on to Shipyard Dr in preparation for the Hingham Ferry Dock upgrades.",
      "description": "There may also be pedestrian detours in the parking lot due to the construction.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662894",
      "title": "Route 220 buses no longer serve this stop due to the new route on Shipyard Drive. Please use Lincoln St @ Lincoln Plaza, about 600 feet away",
      "description": "Affected routes:\r\n220",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "577252",
      "title": "Oak Grove Escalator 105 (Commuter Rail platform to unpaid lobby) unavailable",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "428140",
      "title": "The Upper Parking Lot at Worcester Station is closed with the exception to accessible parking, due to construction.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "580278",
      "title": "Hingham/Hull Ferry: Portions of the Town of Hull parking lot at the Hull ferry terminal are blocked off for sewer pump station construction ",
      "description": null,
      "severity": 4,
      "route_id": "unknown"
    },
    {
      "id": "661805",
      "title": "Routes 71 and 73 are detoured due to construction. The nearest connections are Mt Auburn St @ Mt Auburn Hospital or Mt Auburn St @ Traill St",
      "description": "Affected stops:\r\nMt Auburn St @ Longfellow Rd (outbound)\r\nMt Auburn St @ Sparks St (outbound)\r\nMt Auburn St opp Sparks St (inbound)",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "663135",
      "title": "The Fall River/New Bedford online timetable is being updated. View PDF Timetable on the MBTA website.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "658911",
      "title": "The Prov Ln will experience service & schedule changes. Passengers can expect delays of up to 25 minutes both ways",
      "description": null,
      "severity": 5,
      "route_id": "unknown"
    },
    {
      "id": "662013",
      "title": "Grand Union Blvd @ Foley St stop has moved. Riders can now board at the new Assembly Sq Mobility Hub at the Cnr of Grand Union Blvd & Foley ",
      "description": "Affected routes:\r\n90",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "660418",
      "title": "Hingham/Hull Ferry service will extend an hour later on Fridays from August 29 to September 26. ",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "658552",
      "title": "Route 220 bus service has resumed to and from the Hingham Ferry Terminal. For route information visit mbta.com/schedules/220/",
      "description": null,
      "severity": 5,
      "route_id": "unknown"
    },
    {
      "id": "657362",
      "title": "Elev. #779 from the pedestrian bridge to the platform is temporarily out of service at East Taunton until further notice",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "662271",
      "title": "As of Mon, Aug 25, further schedule adjustments will be implemented on the Franklin/Foxboro Ln reflecting the progress made by Amtrak repair",
      "description": "Train service will resume between Forge Park/495 station and Franklin Station, with inbound trains originating at Forge Park as previously scheduled.\r\n\nFoxboro Line trains 1765 and 1770 will now complete their trips to Foxboro Station.\r\n\nFranklin/Foxboro outbound trains will operate closer to a regular schedule with minor adjustments to allow four trains to make an additional stop at Hyde Park Station, adding approximately three minutes to the schedule and an additional five minutes to the last stop of all outbound trains.\r\n\nFranklin/Foxboro inbound trains will continue to run via the Fairmount Line and will not stop at Ruggles or Back Bay Station. An additional five minutes will be added to the last stop of some inbound evening Franklin/Foxboro trains.\r\n\nMid-day busing between Walpole and Foxboro will continue, as will the cancellation of the mid-day Foxboro trains.\r\n\nTrain 744 (1:59PM Readville) will have a minor schedule adjustment with a three-minute later departure time and three-minute later arrival time, as a result of the changes to the Franklin/Foxboro Line.\r\n\nThe Fairmount Line schedule will be adjusted to accommodate a midday Franklin/Foxboro train (train 744) running as a local via the Fairmount Line.\r\n\nShuttle buses will continue to replace service between Foxboro and Walpole on weekdays between 9:30 a.m. and 2:30 p.m. to allow for construction of a permanent, accessible platform at Foxboro Station. Special event trains for concerts and Patriots games at Gillette Stadium will continue to operate during construction.",
      "severity": 1,
      "route_id": "unknown"
    }
  ],
  "delays_by_route": {},
  "vehicle_positions": [
    {
      "id": "y3342",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.40082257,
      "longitude": -71.0208805,
      "bearing": 219,
      "speed": null,
      "status": null
    },
    {
      "id": "y1994",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.38588704,
      "longitude": -71.07328399,
      "bearing": 199,
      "speed": null,
      "status": null
    },
    {
      "id": "y3110",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.40926514,
      "longitude": -70.99693391,
      "bearing": 122,
      "speed": null,
      "status": null
    },
    {
      "id": "1813",
      "route_id": "CR-Worcester",
      "route_type": null,
      "latitude": 42.2555046081543,
      "longitude": -71.66808319091797,
      "bearing": 52,
      "speed": 16.1,
      "status": null
    },
    {
      "id": "y1945",
      "route_id": "86",
      "route_type": null,
      "latitude": 42.3824303,
      "longitude": -71.10330064,
      "bearing": 271,
      "speed": null,
      "status": null
    },
    {
      "id": "y3296",
      "route_id": "57",
      "route_type": null,
      "latitude": 42.36372,
      "longitude": -71.18551,
      "bearing": 0,
      "speed": null,
      "status": null
    },
    {
      "id": "y1314",
      "route_id": "746",
      "route_type": null,
      "latitude": 42.33052741,
      "longitude": -71.06059333,
      "bearing": 349,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10005",
      "route_id": "Green-B",
      "route_type": null,
      "latitude": 42.34018,
      "longitude": -71.16709,
      "bearing": 135,
      "speed": 1.9,
      "status": null
    },
    {
      "id": "y0902",
      "route_id": "238",
      "route_type": null,
      "latitude": 42.26016486,
      "longitude": -71.00953333,
      "bearing": 315,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10001",
      "route_id": "Green-C",
      "route_type": null,
      "latitude": 42.3362,
      "longitude": -71.14896,
      "bearing": 45,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk303",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338587,
      "longitude": -71.04418,
      "bearing": 306,
      "speed": null,
      "status": null
    },
    {
      "id": "y3272",
      "route_id": "66",
      "route_type": null,
      "latitude": 42.32926,
      "longitude": -71.08386,
      "bearing": 315,
      "speed": null,
      "status": null
    },
    {
      "id": "y1861",
      "route_id": "171",
      "route_type": null,
      "latitude": 42.330617639,
      "longitude": -71.069961419,
      "bearing": 145,
      "speed": null,
      "status": null
    },
    {
      "id": "y0806",
      "route_id": "216",
      "route_type": null,
      "latitude": 42.26015927,
      "longitude": -71.00996462,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "y1881",
      "route_id": "23",
      "route_type": null,
      "latitude": 42.36711846,
      "longitude": -71.01803105,
      "bearing": 326,
      "speed": null,
      "status": null
    },
    {
      "id": "y1932",
      "route_id": "110",
      "route_type": null,
      "latitude": 42.40247158,
      "longitude": -71.04879298,
      "bearing": 97,
      "speed": null,
      "status": null
    },
    {
      "id": "y1964",
      "route_id": "104",
      "route_type": null,
      "latitude": 42.38416492,
      "longitude": -71.07398815,
      "bearing": 170,
      "speed": null,
      "status": null
    },
    {
      "id": "y1855",
      "route_id": "15",
      "route_type": null,
      "latitude": 42.28901453,
      "longitude": -71.04342051,
      "bearing": 169,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk236",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338845,
      "longitude": -71.044155,
      "bearing": 44,
      "speed": null,
      "status": null
    },
    {
      "id": "y3224",
      "route_id": "1",
      "route_type": null,
      "latitude": 42.33517692,
      "longitude": -71.07135452,
      "bearing": 231,
      "speed": null,
      "status": null
    },
    {
      "id": "y1302",
      "route_id": "743",
      "route_type": null,
      "latitude": 42.34753612,
      "longitude": -71.04083275,
      "bearing": 134,
      "speed": null,
      "status": null
    },
    {
      "id": "y3130",
      "route_id": "104",
      "route_type": null,
      "latitude": 42.42397836,
      "longitude": -71.06405406,
      "bearing": 139,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk233",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338865,
      "longitude": -71.043844,
      "bearing": 42,
      "speed": null,
      "status": null
    },
    {
      "id": "y3158",
      "route_id": "95",
      "route_type": null,
      "latitude": 42.38412176,
      "longitude": -71.07634579,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "1700",
      "route_id": "CR-Fitchburg",
      "route_type": null,
      "latitude": 42.56673049926758,
      "longitude": -71.84241485595703,
      "bearing": null,
      "speed": 1.3,
      "status": null
    },
    {
      "id": "y0762",
      "route_id": "225",
      "route_type": null,
      "latitude": 42.26020084,
      "longitude": -71.00987218,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "y1849",
      "route_id": "28",
      "route_type": null,
      "latitude": 42.26660508,
      "longitude": -71.093885179,
      "bearing": 182,
      "speed": null,
      "status": null
    },
    {
      "id": "y1988",
      "route_id": "8993",
      "route_type": null,
      "latitude": 42.40611,
      "longitude": -71.13222,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "y2082",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.41513517,
      "longitude": -71.033898949,
      "bearing": 169,
      "speed": null,
      "status": null
    },
    {
      "id": "y2019",
      "route_id": "70",
      "route_type": null,
      "latitude": 42.3638891,
      "longitude": -71.12240712,
      "bearing": 262,
      "speed": null,
      "status": null
    },
    {
      "id": "y1328",
      "route_id": "746",
      "route_type": null,
      "latitude": 42.34800677,
      "longitude": -71.043626,
      "bearing": 297,
      "speed": null,
      "status": null
    },
    {
      "id": "y1944",
      "route_id": "109",
      "route_type": null,
      "latitude": 42.38745,
      "longitude": -71.07332,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10004",
      "route_id": "Green-B",
      "route_type": null,
      "latitude": 42.34018,
      "longitude": -71.16709,
      "bearing": 135,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk219",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 41.958399,
      "longitude": -71.30247,
      "bearing": 207,
      "speed": null,
      "status": null
    },
    {
      "id": "y1427",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.409617249,
      "longitude": -71.00199878,
      "bearing": 118,
      "speed": null,
      "status": null
    },
    {
      "id": "1823",
      "route_id": "CR-NewBedford",
      "route_type": null,
      "latitude": 41.668067932128906,
      "longitude": -70.93818664550781,
      "bearing": 348,
      "speed": 9.8,
      "status": null
    },
    {
      "id": "y1255",
      "route_id": "16",
      "route_type": null,
      "latitude": 42.33030918,
      "longitude": -71.05809956,
      "bearing": 62,
      "speed": null,
      "status": null
    },
    {
      "id": "y2007",
      "route_id": "77",
      "route_type": null,
      "latitude": 42.40396217,
      "longitude": -71.097359749,
      "bearing": 327,
      "speed": null,
      "status": null
    },
    {
      "id": "1721",
      "route_id": "CR-Providence",
      "route_type": null,
      "latitude": 41.90699768066406,
      "longitude": -71.30976867675781,
      "bearing": 48,
      "speed": 7.6,
      "status": null
    },
    {
      "id": "y1813",
      "route_id": "43",
      "route_type": null,
      "latitude": 42.33008954,
      "longitude": -71.0598696,
      "bearing": 281,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk190",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338467,
      "longitude": -71.043623,
      "bearing": 47,
      "speed": null,
      "status": null
    },
    {
      "id": "y2060",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.38746,
      "longitude": -71.07298,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "y1984",
      "route_id": "109",
      "route_type": null,
      "latitude": 42.42309139,
      "longitude": -71.041223669,
      "bearing": 40,
      "speed": null,
      "status": null
    },
    {
      "id": "y1924",
      "route_id": "23",
      "route_type": null,
      "latitude": 42.3311,
      "longitude": -71.06472,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "y2066",
      "route_id": "101",
      "route_type": null,
      "latitude": 42.38755,
      "longitude": -71.07346,
      "bearing": 180,
      "speed": null,
      "status": null
    },
    {
      "id": "y1321",
      "route_id": "746",
      "route_type": null,
      "latitude": 42.35309197,
      "longitude": -71.05467205,
      "bearing": 308,
      "speed": null,
      "status": null
    },
    {
      "id": "y2102",
      "route_id": "109",
      "route_type": null,
      "latitude": 42.38786,
      "longitude": -71.07353,
      "bearing": 180,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10006",
      "route_id": "Green-C",
      "route_type": null,
      "latitude": 42.3362,
      "longitude": -71.14896,
      "bearing": 45,
      "speed": 3.1,
      "status": null
    },
    {
      "id": "y2086",
      "route_id": "137",
      "route_type": null,
      "latitude": 42.38691638,
      "longitude": -71.07772443,
      "bearing": 335,
      "speed": null,
      "status": null
    },
    {
      "id": "y3100",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.45524397,
      "longitude": -70.97412225,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "y1862",
      "route_id": "16",
      "route_type": null,
      "latitude": 42.341,
      "longitude": -71.05747,
      "bearing": 135,
      "speed": null,
      "status": null
    },
    {
      "id": "y2080",
      "route_id": "110",
      "route_type": null,
      "latitude": 42.40670047,
      "longitude": -71.02417582,
      "bearing": 95,
      "speed": null,
      "status": null
    },
    {
      "id": "y1991",
      "route_id": "74",
      "route_type": null,
      "latitude": 42.37695,
      "longitude": -71.12244,
      "bearing": 315,
      "speed": null,
      "status": null
    },
    {
      "id": "y1651",
      "route_id": "32",
      "route_type": null,
      "latitude": 42.24256,
      "longitude": -71.13044,
      "bearing": 180,
      "speed": null,
      "status": null
    },
    {
      "id": "y1992",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.40307233,
      "longitude": -71.03899275,
      "bearing": 34,
      "speed": null,
      "status": null
    },
    {
      "id": "y3135",
      "route_id": "70",
      "route_type": null,
      "latitude": 42.38452943,
      "longitude": -71.07391676,
      "bearing": 200,
      "speed": null,
      "status": null
    },
    {
      "id": "y2098",
      "route_id": "104",
      "route_type": null,
      "latitude": 42.37748036,
      "longitude": -71.026354979,
      "bearing": 42,
      "speed": null,
      "status": null
    },
    {
      "id": "y1871",
      "route_id": "16",
      "route_type": null,
      "latitude": 42.3411,
      "longitude": -71.05773,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "y1646",
      "route_id": "39",
      "route_type": null,
      "latitude": 42.2705063,
      "longitude": -71.120354289,
      "bearing": 154,
      "speed": null,
      "status": null
    },
    {
      "id": "y2055",
      "route_id": "71",
      "route_type": null,
      "latitude": 42.38812294,
      "longitude": -71.07305803,
      "bearing": 163,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk250",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338982,
      "longitude": -71.044363,
      "bearing": 57,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk315",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338767,
      "longitude": -71.044067,
      "bearing": 312,
      "speed": null,
      "status": null
    }
  ]
}