{
  "last_updated": "2025-11-10T06:38:02.529741",
  "total_routes": 177,
  "active_vehicles": 90,
  "status": "active",
  "routes_by_type": {},
  "active_alerts": [
    {
      "id": "435698",
      "title": "Bowdoin Escalator 125 (Lobby to street) is unavailable until further notice.",
      "description": "The escalator will remain out of service for the foreseeable future. This decision was made after a thorough inspection determined that corrosion on the escalator’s steel truss was so severe that it could not be repaired further and that a complete replacement of the escalator would be required. Replacing the escalator at this location requires a more extended unit meeting modern escalator safety requirements. This longer unit will require significant alteration to the station entrance to meet code requirements. The MBTA has currently begun design work to understand what station upgrades will be needed. \r\n  \r\nDue to these complexities, we expect the escalator will remain out of service for a significant time. We recognize the challenges this poses to our riders, and please know we are working to identify a solution as quickly as possible. In the meantime, Government Center Station, which is fully accessible and serves the Blue Line, is under a quarter-mile from Bowdoin Station. \r\n",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "669829",
      "title": "The Providence/Stoughton Line has a new emergency Amtrak repair schedule effective 10/27 until further notice.",
      "description": "-Construction and service updates for the Franklin/Foxboro, Providence/Stoughton, and Fairmount Lines will be provided as work progresses.\r\n\n-Holiday service: On Thursday, November 27th, 2025 (Thanksgiving Day), Thursday, December 25th, 2025 (Christmas Day), Thursday, January 1st, 2026 (New Year’s Day), and Monday, February 16th, 2026 (President’s Day) all lines will operate on a weekend schedule. On Tuesday, November 11th, 2025 (Veterans' Day), Friday, November 28th, 2025 (Day after Thanksgiving), Monday, January 19th, 2026 (Martin Luther King Jr. Day), and Monday, April 20th, 2026 (Patriot’s Day), all lines will operate on a regular weekday schedule.",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "656012",
      "title": "To accommodate Prov Sta Renovations, construction barriers have been installed & the Southern stairwell to Track 1 & 3 is out of service",
      "description": "Affected lines:\r\nProvidence/Stoughton Line\r\nFoxboro (Special Events)",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "416078",
      "title": "Lynn Parking Garage arcade stairs 1 & 2 are closed until further notice. Customers may exit the garage via elevators to the ground level or ",
      "description": "Vehicular access to the upper 2 levels of the garage is restricted. The garage has sufficient parking capacity to accommodate daily demand.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "673548",
      "title": "Wollaston Parking Lot will be partially closed from Oct 27 through Nov 28. Use the N Quincy Garage or the Quincy Adams Garage as alternative",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "661698",
      "title": "Rt. 34E detoured. The nearest inb. connections are 710 East St opp Kendall St or Washington St opp Washington Green. The nearest outb. conne",
      "description": "Affected stops:\r\nWashington St @ Short St (outbound)\r\nWashington St @ Lafayette Dr (outbound)\r\n625 Washington St (outbound)\r\n624 Washington St opp Bird Middle School (inbound)\r\nWashington St @ Pilgrim Way (inbound)\r\nWashington St @ Polley Ln (inbound)",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "652201",
      "title": "Jackson Sq: The stairway connecting the lobby & the south end of the platform is closed. Use the stairway at the north end of the platform.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "639578",
      "title": "Malden Center Escalator 312 (Street level to Commuter Rail platform) unavailable due to maintenance.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "630009",
      "title": "There is no accessible path connecting the inb. & outb. platforms at Wellesley Sq Sta. The existing path includes steep slopes & is long. ",
      "description": "There are accessible mini-high platforms at the Western end of both the Track 1 and Track 2 sides. However, the existing pedestrian path between the two sides is long and includes steep slopes, especially on the Crest Road bridge over the tracks. Designs are underway to provide for a fully compliant pathway. ",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "625935",
      "title": "Littleton/Route 495 passengers can expect occasional traffic and detours accessing the station due to the Foster Street reconstruction work",
      "description": "Scheduled to complete sometime in 2027, the Reconstruction of Foster Street includes widening and resurfacing with the addition of bicycle lanes.  ",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "677170",
      "title": "Somerville Ave opp Central St is moving through Wed Nov 26. Riders can board the temporary stop located outside of Veterans Memorial Rink",
      "description": "Affected routes:\r\n83\r\n87",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "507767",
      "title": "Beginning Fri, Jun 30, the Riverside Ave entrance at Campello Station will be closed.",
      "description": "Affected lines:\r\nFall River/New Bedford Line",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "665121",
      "title": "Chinatown Elev. 876 is unavailable until further notice while it undergoes major equipment upgrades",
      "description": "The elevator will be closed for work that will significantly improve its long-term reliability.\r\n\nTo Exit:\r\nTake an Oak Grove Train to Downtown Crossing; then take Downtown Crossing elevator 891 to Franklin Street. At Franklin Street customers should turn left and travel 450 feet south on Washington Street then take Downtown Crossing elevator 892 to the Forest Hills platform. Then take a Forest Hills Train to Chinatown and use elevator 922 to exit the station.\r\n\nTo Board:\r\nGo to Chinatown Elevator 922 on Essex St. Take Elevator 922 to the Forest Hills platform. Take a Forest Hills train to Tufts Medical Center. Transfer to an Oak Grove train.\r\n",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "667716",
      "title": "Rt. 40 detoured beginning Mon, Sep 29, 2025 until further notice. Buses will omit Georgetowne Dr @ Margaretta Dr",
      "description": "Affected stops:\r\nGeorgetowne Dr @ Margaretta Dr (outbound)\r\nMargaretta Dr @ Crown Point Dr (outbound)\r\nMargaretta Dr @ Crown Point Dr (inbound)\r\nGeorgetowne Dr opp Margaretta Dr (inbound)",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "662747",
      "title": "Route 429 detoured due to construction. The nearest outbound connections are Lynn Station and Market St @ Liberty St.",
      "description": "Affected direction: Outbound\r\n\nAffected stops:\r\nOxford St @ Washington St\r\nOxford St @ Market St",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "675718",
      "title": "Amesbury St @ Vassar St (outbound) has moved permanently to Vassar St @ Audrey St.",
      "description": "Affected routes:\r\nCT2",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "490115",
      "title": "Andrew Escalator 123 (Ashmont/Braintree platform to busway) is unavailable until further notice pending replacement.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "677171",
      "title": "Somerville Ave @ Central St is moving through Wed Nov 26. Riders can board at the temporary stop located on the opposite side of Bleachery C",
      "description": "Affected routes:\r\n83\r\n87",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "658350",
      "title": "Ruggles Escalator 136 (Orange Line platform to upper lobby) unavailable",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "676584",
      "title": "The Route 112 & 114 stops at the Market Basket in Chelsea are permanently moving to the other side of the store due to construction.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "678108",
      "title": "Wonderland Elevator 709 (North Shore Road Busway to pedestrian plaza) unavailable due to maintenance",
      "description": "To access the pedestrian plaza from the North Shore Rd entrance, enter the lobby and use Wonderland Garage Elevators 701, 702 or 703. Exit the elevator at level 2, turn right and proceed to the pedestrian plaza. To access North Shore Rd from the pedestrian plaza, travel up the ramp to Wonderland garage--level 2 and use Wonderland Elevators 701, 702 or 703. Exit the elevator at ground level, turn right and proceed to the main lobby entrance.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "677315",
      "title": "Braintree Escalator 334 (Red Line platform to paid lobby) unavailable due to maintenance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "635231",
      "title": "S Station Pedal & Park is closed. Bicycle racks are currently available on Atlantic Ave adjacent to the S Station main entrance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "667834",
      "title": "Government Center Escalator 446 (Blue Line platform to Green Line platform) unavailable due to maintenance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "390224",
      "title": "Courthouse Escalator 417 (Airport/Design Center platform to south lobby) unavailable due to maintenance",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "663338",
      "title": "A new Fairmount Ln schedule will be in effect starting on Mon, Sep 8. These changes reflect the Amtrak infrastructure repair progress",
      "description": "The Fairmount temporary construction schedule will remain in effect as the rail replacement project to prepare the line for battery-electric trains continues.\r\n\nConstruction and service updates for the Franklin/Foxboro, Providence/Stoughton, and Fairmount Lines will be provided as work progresses.",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "673383",
      "title": "Green Ln: No train service between Medford/Tufts, Union Sq., & Park St., through Nov 13, for track work. ",
      "description": "C Branch eastbound service will be terminating at Kenmore. Riders can take any westbound B or D Branch train to Kenmore to board a train towards Cleveland Circle. \r\n\nTravel Time:\r\nRiders using the shuttles buses should budget extra travel time. For example, a rider traveling to Park St from Medford/Tufts should add at least an additional 45 minutes of travel in additional to their regular commute.     \r\n\nAccessibility Information:\r\nAccessible van service will be available at Magoun Square. Riders can request this service by seeing onsite personnel.        MBTA buses that service Union Sq. are accessible.\r\n\nUnion Square Bus Alternatives:\r\nRoute 87 riders can connect to shuttles at Lechmere.\r\nRoute 91 riders can connect to shuttles at East Somerville, the Red Line at Central, or the Orange Line at Sullivan Square. \r\nRoute 109 riders can connect to shuttles at East Somerville, the Red Line at Harvard, or the Orange Line at Sullivan Square. \r\n\nOrange Line Access from Park St:\r\nRiders can use the Winter Street Concourse to walk between the Green Line at Park St and the Orange Line at Downtown Crossing. The entrance to the Concourse is adjacent to the Green Line track with service towards Government Center and points north.\r\n - As soon as you enter the concourse, turn right and exit through the faregate.\r\n- Take Park elevator 804 to Tremont St and turn left.\r\n - Turn right on Winter St.\r\n - Turn left on Washington St and go approximately 200 to 300 ft.\r\n - Turn right at the Franklin St plaza and take DTX elevator 891 to the Orange Line northbound platform.\r\n\nFree Bluebikes Access:\r\nDuring this closure, the City of Boston is offering a promotion code for up to five free Bluebikes unlocks, MBTAGREEN114. After 30 minutes, a charge of $0.25/minute will be applied.\r\n\nShuttle stops:\r\n\nMedford/Tufts:\r\nCollege Ave @ Boston Ave\r\n\nBall Square:\r\nNorthbound - Ball Sq Station (Boston Ave @ Broadway)\r\nSouthbound - Ball Sq Station (Broadway @ Boston Ave)\r\n \r\nMagoun Square:\r\nNorthbound - 525 Medford St (Medford St @ Broadway)\r\nSouthbound - 532 Medford St (Medford St @ Broadway)\r\n\nGilman Square:\r\nNorthbound & Southbound - Medford St @ School St\r\n\nEast Somerville:\r\nNorthbound - McGrath Hwy @ Alston St\r\nSouthbound - Medford St @ Washington St\r\n\nUnion Square:\r\nNo shuttle buses. \r\n\nLechmere:\r\nNorthbound & Southbound - Lechmere Busway\r\n\nScience Park/West End:\r\nNorthbound - Nashua Street Park\r\nSouthbound - 6 Whittier Place (Martha Rd @ Whittier Place)\r\n\nNorth Station:\r\nNorthbound - Nashua St @ Red Auerbach Way \r\n\nSubway Connections:\r\n- North Station (Transfer within Station to Orange Line)\r\n- Haymarket (Transfer within Station to Orange Line.)\r\n- Government Center (use State, 0.2 mi.)\r\n- Park Street (use the Winter St Concourse to Downtown Crossing, 0.2 mi.)",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "634987",
      "title": "State Escalator 6 (Oak Grove platform to Old State House lobby) unavailable",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "651836",
      "title": "Assembly Escalator 442 (Foley Street to unpaid lobby) unavailable due to maintenance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "390223",
      "title": "Courthouse Escalator 415 (Airport/Design Center platform to lobby) unavailable due to ongoing construction at the station. ",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "674141",
      "title": "The Northern Ave @ Tide St stops are moving, Nov 6, to Mon, Nov 10. The inb. stop is moving 100 feet east, in front of Drydock Plaza Park. T",
      "description": "Affected routes:\r\nSilver Line - SL2\r\n4",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "661599",
      "title": "Construction is ongoing in the Hingham Parking lot & on Shipyard Dr in preparation for the Hingham Ferry Dock upgrades. ",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "672170",
      "title": "The stop at Somerville Ave @ Union Sq has moved permanently to the intersection of Somerville Ave & Hawkins St, about 350 feet away",
      "description": "Affected routes:\r\n85\r\n87",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "577252",
      "title": "Oak Grove Escalator 105 (Commuter Rail platform to unpaid lobby) unavailable",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "428140",
      "title": "The Upper Parking Lot at Worcester Station is closed with the exception to accessible parking, due to construction.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "663337",
      "title": "The Franklin/Foxboro Line has an emergency Amtrak repair temporary schedule in effect until further notice.  ",
      "description": "The Franklin/Foxboro Line remains on a temporary construction schedule as Amtrak’s emergency infrastructure repairs will continue beyond October 27th.\r\n\nConstruction and service updates for the Franklin/Foxboro, Providence/Stoughton, and Fairmount Lines will be provided as work progresses.",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "580278",
      "title": "Hingham/Hull Ferry: Portions of the Town of Hull parking lot at the Hull ferry terminal are blocked off for sewer pump station construction ",
      "description": null,
      "severity": 4,
      "route_id": "unknown"
    },
    {
      "id": "665175",
      "title": "Route 435 detoured due to construction. The nearest outbound connections are Neptune Blvd @ Blossom St and Lynn Station.",
      "description": "Affected direction: Outbound\r\n\nAffected stops:\r\nTremont St opp St Mary's High School\r\nMarket St @ Tremont St",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "661805",
      "title": "Routes 71 and 73 are detoured due to construction. The nearest connections are Mt Auburn St @ Mt Auburn Hospital or Mt Auburn St @ Traill St",
      "description": "Affected stops:\r\nMt Auburn St @ Longfellow Rd (outbound)\r\nMt Auburn St @ Sparks St (outbound)\r\nMt Auburn St opp Sparks St (inbound)",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "668492",
      "title": "Jackson Sq: The platform is undergoing renovations until fall 2025 to improve safety & accessibility. ",
      "description": "Please see station personnel or use a station call box to request assistance.",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "677449",
      "title": "Braintree Ivory St Parking Lot will be closed from Mon, Nov 10 through Sat, Nov 15. Alternative parking is available at Braintree Garage & Q",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "676885",
      "title": "The Route 47 Green St @ Magazine St bus stop is closed through Jan 2026. Please board at Green St @ Pearl St for service to Broadway",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    }
  ],
  "delays_by_route": {},
  "vehicle_positions": [
    {
      "id": "y3225",
      "route_id": "Shuttle-Generic-Green",
      "route_type": null,
      "latitude": 42.350378,
      "longitude": -71.05959,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y1300",
      "route_id": "743",
      "route_type": null,
      "latitude": 42.367337,
      "longitude": -71.029223,
      "bearing": 121,
      "speed": null,
      "status": null
    },
    {
      "id": "R-548664EF",
      "route_id": "Red",
      "route_type": null,
      "latitude": 42.30002,
      "longitude": -71.06183,
      "bearing": 260,
      "speed": null,
      "status": null
    },
    {
      "id": "y1972",
      "route_id": "96",
      "route_type": null,
      "latitude": 42.41335,
      "longitude": -71.120518,
      "bearing": 24,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk257",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201846,
      "longitude": -71.065,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10173",
      "route_id": "Green-D",
      "route_type": null,
      "latitude": 42.3268,
      "longitude": -71.16464,
      "bearing": 270,
      "speed": 5.1,
      "status": null
    },
    {
      "id": "y3217",
      "route_id": "Shuttle-Generic-Green",
      "route_type": null,
      "latitude": 42.34069,
      "longitude": -71.06451,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "y1269",
      "route_id": "39",
      "route_type": null,
      "latitude": 42.310284,
      "longitude": -71.114953,
      "bearing": 206,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk318",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338615,
      "longitude": -71.043866,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10196",
      "route_id": "Green-C",
      "route_type": null,
      "latitude": 42.33984,
      "longitude": -71.12983,
      "bearing": 225,
      "speed": 8.7,
      "status": null
    },
    {
      "id": "ynk308",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338229,
      "longitude": -71.044264,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y3310",
      "route_id": "426",
      "route_type": null,
      "latitude": 42.427033,
      "longitude": -71.013646,
      "bearing": 320,
      "speed": null,
      "status": null
    },
    {
      "id": "y1270",
      "route_id": "28",
      "route_type": null,
      "latitude": 42.26713,
      "longitude": -71.09165,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "y3271",
      "route_id": "Shuttle-Generic-Green",
      "route_type": null,
      "latitude": 42.339111,
      "longitude": -71.063597,
      "bearing": 18,
      "speed": null,
      "status": null
    },
    {
      "id": "y1272",
      "route_id": "28",
      "route_type": null,
      "latitude": 42.328646,
      "longitude": -71.083883,
      "bearing": 100,
      "speed": null,
      "status": null
    },
    {
      "id": "y0805",
      "route_id": "210",
      "route_type": null,
      "latitude": 42.300087,
      "longitude": -71.06145,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk303",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338457,
      "longitude": -71.043959,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk237",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.20187,
      "longitude": -71.064723,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk252",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201885,
      "longitude": -71.064946,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y1965",
      "route_id": "104",
      "route_type": null,
      "latitude": 42.425328,
      "longitude": -71.065072,
      "bearing": 335,
      "speed": null,
      "status": null
    },
    {
      "id": "y1915",
      "route_id": "9",
      "route_type": null,
      "latitude": 42.338054,
      "longitude": -71.04447,
      "bearing": 282,
      "speed": null,
      "status": null
    },
    {
      "id": "y1881",
      "route_id": "23",
      "route_type": null,
      "latitude": 42.336672,
      "longitude": -71.088621,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "y1964",
      "route_id": "73",
      "route_type": null,
      "latitude": 42.384022,
      "longitude": -71.181664,
      "bearing": 320,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk236",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201892,
      "longitude": -71.064766,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk253",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201899,
      "longitude": -71.064632,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk256",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.20181,
      "longitude": -71.065311,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk333",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201879,
      "longitude": -71.064601,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk233",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.339052,
      "longitude": -71.044353,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y1947",
      "route_id": "77",
      "route_type": null,
      "latitude": 42.41161,
      "longitude": -71.148384,
      "bearing": 334,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk223",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201846,
      "longitude": -71.065378,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y2004",
      "route_id": "71",
      "route_type": null,
      "latitude": 42.37007,
      "longitude": -71.17134,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10037",
      "route_id": "Mattapan",
      "route_type": null,
      "latitude": 42.28367,
      "longitude": -71.06316,
      "bearing": 315,
      "speed": 3.7,
      "status": null
    },
    {
      "id": "y0779",
      "route_id": "216",
      "route_type": null,
      "latitude": 42.263617,
      "longitude": -70.971739,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "y3241",
      "route_id": "Shuttle-Generic-Green",
      "route_type": null,
      "latitude": 42.392354,
      "longitude": -71.10042,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y1857",
      "route_id": "23",
      "route_type": null,
      "latitude": 42.295413,
      "longitude": -71.072123,
      "bearing": 172,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk226",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201865,
      "longitude": -71.064718,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y3144",
      "route_id": "83",
      "route_type": null,
      "latitude": 42.394176,
      "longitude": -71.138201,
      "bearing": 1,
      "speed": null,
      "status": null
    },
    {
      "id": "y1895",
      "route_id": "1",
      "route_type": null,
      "latitude": 42.334478,
      "longitude": -71.074661,
      "bearing": 144,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk322",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201779,
      "longitude": -71.064479,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y1803",
      "route_id": "23",
      "route_type": null,
      "latitude": 42.288847,
      "longitude": -71.066741,
      "bearing": 162,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk228",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201868,
      "longitude": -71.065198,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y2053",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.398366,
      "longitude": -71.030938,
      "bearing": 335,
      "speed": null,
      "status": null
    },
    {
      "id": "y3312",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.40729,
      "longitude": -71.014281,
      "bearing": 205,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk231",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201852,
      "longitude": -71.065036,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y1752",
      "route_id": "11",
      "route_type": null,
      "latitude": 42.331544,
      "longitude": -71.036667,
      "bearing": 88,
      "speed": null,
      "status": null
    },
    {
      "id": "y1876",
      "route_id": "16",
      "route_type": null,
      "latitude": 42.31591,
      "longitude": -71.0664,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "y1909",
      "route_id": "57",
      "route_type": null,
      "latitude": 42.36373,
      "longitude": -71.18512,
      "bearing": 135,
      "speed": null,
      "status": null
    },
    {
      "id": "y1273",
      "route_id": "749",
      "route_type": null,
      "latitude": 42.33631,
      "longitude": -71.0773,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk259",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201533,
      "longitude": -71.065144,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y1973",
      "route_id": "89",
      "route_type": null,
      "latitude": 42.399835,
      "longitude": -71.111749,
      "bearing": 115,
      "speed": null,
      "status": null
    },
    {
      "id": "y2094",
      "route_id": "88",
      "route_type": null,
      "latitude": 42.398623,
      "longitude": -71.124168,
      "bearing": 324,
      "speed": null,
      "status": null
    },
    {
      "id": "y1801",
      "route_id": "10",
      "route_type": null,
      "latitude": 42.335555,
      "longitude": -71.043173,
      "bearing": 88,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk255",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338907,
      "longitude": -71.044297,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk173",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338647,
      "longitude": -71.043987,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "O-548664F3",
      "route_id": "Orange",
      "route_type": null,
      "latitude": 42.30119,
      "longitude": -71.11376,
      "bearing": 210,
      "speed": null,
      "status": null
    },
    {
      "id": "y1259",
      "route_id": "28",
      "route_type": null,
      "latitude": 42.3368,
      "longitude": -71.08902,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk174",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201742,
      "longitude": -71.064492,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk207",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.33889,
      "longitude": -71.044325,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y3278",
      "route_id": "Shuttle-Generic-Green",
      "route_type": null,
      "latitude": 42.41336,
      "longitude": -71.11075,
      "bearing": 0,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10010",
      "route_id": "Green-B",
      "route_type": null,
      "latitude": 42.34204,
      "longitude": -71.14477,
      "bearing": 225,
      "speed": 7.9,
      "status": null
    },
    {
      "id": "y2006",
      "route_id": "106",
      "route_type": null,
      "latitude": 42.427925,
      "longitude": -71.064204,
      "bearing": 59,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk224",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201874,
      "longitude": -71.064962,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk230",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201835,
      "longitude": -71.065434,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y2110",
      "route_id": "95",
      "route_type": null,
      "latitude": 42.420623,
      "longitude": -71.142728,
      "bearing": 263,
      "speed": null,
      "status": null
    },
    {
      "id": "y1993",
      "route_id": "110",
      "route_type": null,
      "latitude": 42.41553,
      "longitude": -71.03247,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "y1872",
      "route_id": "15",
      "route_type": null,
      "latitude": 42.336513,
      "longitude": -71.089077,
      "bearing": 180,
      "speed": null,
      "status": null
    },
    {
      "id": "y1998",
      "route_id": "134",
      "route_type": null,
      "latitude": 42.418422,
      "longitude": -71.106476,
      "bearing": 0,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10063",
      "route_id": "Green-E",
      "route_type": null,
      "latitude": 42.32825,
      "longitude": -71.11032,
      "bearing": 45,
      "speed": 3.4,
      "status": null
    },
    {
      "id": "ynk254",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201862,
      "longitude": -71.065097,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y3207",
      "route_id": "Shuttle-Generic-Green",
      "route_type": null,
      "latitude": 42.40013,
      "longitude": -71.11292,
      "bearing": 135,
      "speed": null,
      "status": null
    },
    {
      "id": "y3135",
      "route_id": "87",
      "route_type": null,
      "latitude": 42.398358,
      "longitude": -71.123948,
      "bearing": 329,
      "speed": null,
      "status": null
    },
    {
      "id": "y1922",
      "route_id": "43",
      "route_type": null,
      "latitude": 42.335147,
      "longitude": -71.088396,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "y3222",
      "route_id": "Shuttle-Generic-Green",
      "route_type": null,
      "latitude": 42.3412,
      "longitude": -71.06492,
      "bearing": 135,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk234",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201565,
      "longitude": -71.065215,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk247",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201596,
      "longitude": -71.065279,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y1835",
      "route_id": "66",
      "route_type": null,
      "latitude": 42.345519,
      "longitude": -71.127272,
      "bearing": 136,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk307",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338459,
      "longitude": -71.043632,
      "bearing": 41,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk235",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201551,
      "longitude": -71.065165,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk249",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201838,
      "longitude": -71.065283,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y3142",
      "route_id": "104",
      "route_type": null,
      "latitude": 42.419052,
      "longitude": -71.052671,
      "bearing": 124,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk248",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201832,
      "longitude": -71.064853,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y1838",
      "route_id": "57",
      "route_type": null,
      "latitude": 42.351979,
      "longitude": -71.123196,
      "bearing": 98,
      "speed": null,
      "status": null
    },
    {
      "id": "y3354",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.358887,
      "longitude": -71.057271,
      "bearing": 325,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk232",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201867,
      "longitude": -71.064793,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk222",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201821,
      "longitude": -71.06537,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk339",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.201851,
      "longitude": -71.064499,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y2020",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.364134,
      "longitude": -71.058464,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk250",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.20184,
      "longitude": -71.065284,
      "bearing": null,
      "speed": null,
      "status": null
    },
    {
      "id": "y3253",
      "route_id": "Shuttle-Generic-Green",
      "route_type": null,
      "latitude": 42.400509,
      "longitude": -71.113858,
      "bearing": 115,
      "speed": null,
      "status": null
    },
    {
      "id": "y1630",
      "route_id": "32",
      "route_type": null,
      "latitude": 42.27895,
      "longitude": -71.11918,
      "bearing": 180,
      "speed": null,
      "status": null
    }
  ]
}