{
  "last_updated": "2025-08-25T08:33:45.398779",
  "total_routes": 178,
  "active_vehicles": 77,
  "status": "active",
  "routes_by_type": {},
  "active_alerts": [
    {
      "id": "435698",
      "title": "Bowdoin Escalator 125 (Lobby to street) is unavailable until further notice.",
      "description": "The escalator will remain out of service for the foreseeable future. This decision was made after a thorough inspection determined that corrosion on the escalator’s steel truss was so severe that it could not be repaired further and that a complete replacement of the escalator would be required. Replacing the escalator at this location requires a more extended unit meeting modern escalator safety requirements. This longer unit will require significant alteration to the station entrance to meet code requirements. The MBTA has currently begun design work to understand what station upgrades will be needed. \r\n  \r\nDue to these complexities, we expect the escalator will remain out of service for a significant time. We recognize the challenges this poses to our riders, and please know we are working to identify a solution as quickly as possible. In the meantime, Government Center Station, which is fully accessible and serves the Blue Line, is under a quarter-mile from Bowdoin Station. \r\n",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "656012",
      "title": "To accommodate Prov Sta Renovations, construction barriers have been installed & the Southern stairwell to Track 1 & 3 is out of service",
      "description": "Affected lines:\r\nProvidence/Stoughton Line\r\nFoxboro (Special Events)",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "416078",
      "title": "Lynn Parking Garage arcade stairs 1 & 2 are closed until further notice. Customers may exit the garage via elevators to the ground level or ",
      "description": "Vehicular access to the upper 2 levels of the garage is restricted. The garage has sufficient parking capacity to accommodate daily demand.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "661698",
      "title": "Rt. 34E detoured. Inb. connections are 710 East St opp Kendall St or Washington St opp Washington Green. Outb. connections are Washington St",
      "description": "Affected stops:\r\n624 Washington St opp Bird Middle School (inbound)\r\nWashington St @ Pilgrim Way (inbound)\r\nWashington St @ Polley Ln (inbound)",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "660933",
      "title": "State Elev. 803 is out of service pending major equipment upgrades. We will return this elevator to service as soon as possible.",
      "description": "To exit, proceed to the end of the Forest Hills platform and continue down the hallway (follow signs for Oak Grove and Blue Line) to the Wonderland platform. At the Wonderland platform, proceed to the 53 State St lobby and use State Elevator 975. To board a Forest Hills-bound train, cross Milk St and proceed south on Washington St for one-tenth of a mile to the intersection of Washington St and Winter St, and use Downtown Crossing Elevator 892. To board an Oak Grove-bound train, cross Milk St and proceed south on Washington St for one block to the intersection of Washington St and Franklin St, and use Downtown Crossing Elevator 891 to access the Oak Grove platform.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "652201",
      "title": "Jackson Sq: The stairway connecting the lobby & the south end of the platform is closed. Use the stairway at the north end of the platform.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "639578",
      "title": "Malden Center Escalator 312 (Street level to Commuter Rail platform) unavailable due to maintenance.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "630009",
      "title": "There is no accessible path connecting the inb. & outb. platforms at Wellesley Sq Sta. The existing path includes steep slopes & is long. ",
      "description": "There are accessible mini-high platforms at the Western end of both the Track 1 and Track 2 sides. However, the existing pedestrian path between the two sides is long and includes steep slopes, especially on the Crest Road bridge over the tracks. Designs are underway to provide for a fully compliant pathway. ",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "625935",
      "title": "Littleton/Route 495 passengers can expect occasional traffic and detours accessing the station due to the Foster Street reconstruction work",
      "description": "Scheduled to complete sometime in 2027, the Reconstruction of Foster Street includes widening and resurfacing with the addition of bicycle lanes.  ",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "661030",
      "title": "Park St Elev. 808 unavailable from Mon Aug 25 through Sun Oct 5",
      "description": "The elevator will be closed for major equipment upgrades that will significantly improve the long-term reliability of this elevator.\r\n\nTo exit: from the Red Line Center platform, take Park Street Elevator 979 to the Green Line Copley & West platform. Exit faregates. Take Elevator 978 to the Boston Common. \r\n\nTo Red Line: from street level, take Park Street Elevator 978 on the Boston Common to the Green Line Copley & West lobby. Enter faregates. Turn left. Take Elevator 979 to the Red Line center platform. \\n\\n\r\n\nTo Red Line: from Winter St Concourse, go to the end of the Green Line Gov Ctr & North platform. Use Elevator 812. Turn left. Take Elevator 823 to the Copley & West platform. Go to the east end of the platform. Take Elevator 979 to the Red Line center platform.\r\n",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662183",
      "title": "Beginning on Sun, Aug 24, 2025, Rts. 62 & 76 will run as separate Rts.",
      "description": "Routes 62 & 76: Bedford VA Hospital – Alewife Station, Hanscom Airport, and Lincoln Lab:\r\n\nIf you ride the combined Route 62/76:\r\nThe combined 62/76 route pattern will be discontinued, ending Saturday service to Lincoln Lab and all service on Hartwell Ave in Lexington.\r\n\nFor weekday service between Lexington Center, Hanscom Field, and Lincoln Lab, use Route 76.\r\nFor Saturday service between Lexington Center, Hanscom Field, and Lincoln Lab, use an alternative travel option.\r\nOn Hartwell Ave in Lexington, use Route 62 or an alternative travel option.\r\n\nIf you ride Route 62:\r\nYou'll have more frequent service, every day of the week. There won't be any changes to the route.\r\n\nRoute 62 will run every day, with weekend service on both Saturday and Sunday.\r\nOn weekdays during peak hours (7 – 9 AM and 4 – 6:30 PM), a Route 62 bus will arrive every 30 minutes, compared to 45 minutes today.\r\n\nOn weekdays during peak hours, between Alewife and Lexington Center, a 62 or 76 bus will arrive every 15 – 30 minutes.\r\n\nOn weekends, a Route 62 bus will arrive every 50 minutes, compared to 65 minutes on the 62/76 today. \r\nTrips between the Bedford VA Hospital and Alewife will be 15 – 20 minutes shorter.\r\n\nIf you ride Route 76:\r\nRoute 76 will continue to run on weekdays only, with more frequent service during peak hours (7 – 9 AM and 4 – 6:30 PM). There won't be any changes to the route.\r\n\nDuring peak hours, a Route 76 bus will arrive every 30 minutes, compared to 45 minutes today.\r\nDuring peak hours, between Alewife and Lexington Center, a 62 or 76 bus will arrive every 15 – 30 minutes.\r\nRoute 76 will run new midday and evening service.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "507767",
      "title": "Beginning Fri, Jun 30, the Riverside Ave entrance at Campello Station will be closed.",
      "description": "Affected lines:\r\nFall River/New Bedford Line",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "662142",
      "title": "At Alewife, Route 350 inbound will move down one berth and board at Berth B4 beginning on Sunday, August 24. ",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "490115",
      "title": "Andrew Escalator 123 (Ashmont/Braintree platform to busway) is unavailable until further notice pending replacement.",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662145",
      "title": "At Alewife, Route 67 inbound will move down one berth and board at Berth B3 beginning on Sunday, August 24. ",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "658350",
      "title": "Ruggles Escalator 136 (Orange Line platform to upper lobby) unavailable",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "652726",
      "title": "Hynes Convention Center Esc. 315 (Kenmore & West platform to paid lobby) unavailable from Mon Aug 11 through Fri Aug 29 due to maintenance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "635231",
      "title": "S Station Pedal & Park is closed. Bicycle racks are currently available on Atlantic Ave adjacent to the S Station main entrance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "390224",
      "title": "Courthouse Escalator 417 (Airport/Design Center platform to south lobby) unavailable due to maintenance",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "652202",
      "title": "Jackson Sq: The platform is undergoing renovations until fall 2025 to improve safety & accessibility. ",
      "description": "Please see station personnel or use a station call box to request assistance.",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "655098",
      "title": "George's Island will remain closed for the 2025 season due to continued water main problems.",
      "description": "Affected routes:\r\nHingham/Hull Ferry",
      "severity": 10,
      "route_id": "unknown"
    },
    {
      "id": "662147",
      "title": "At Alewife, Route 76 inbound will move down two berths and board at Berth B1 beginning on Sunday, August 24. ",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "659683",
      "title": "Please board Prov Line Train 802 on the outbound platform at Pawtucket/Central Falls & S Attleboro on weekdays until further notice",
      "description": "Affected direction: Inbound\r\n\nAffected stops:\r\nPawtucket/Central Falls\r\nSouth Attleboro\r\n\nAffected trips:\r\n802 (4:12 am from Providence)\r\n",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "651836",
      "title": "Assembly Escalator 442 (Foley Street to unpaid lobby) unavailable due to maintenance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "634987",
      "title": "State Escalator 6 (Oak Grove platform to Old State House lobby) unavailable",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "390223",
      "title": "Courthouse Escalator 415 (Airport/Design Center platform to lobby) unavailable due to ongoing construction at the station. ",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "658919",
      "title": " All inb. Franklin/Foxboro trains will bypass Forest Hills, Ruggles & Back Bay. After 9am, all Franklin Ln trains will terminate & originate",
      "description": "Affected direction: Inbound\r\n\nInbound Franklin/Foxboro Line passengers traveling to Forest Hills, Ruggles, or Back Bay may:\r\n- Transfer to a Providence Line train at Readville (Track 4)\r\n- Stay on inbound Franklin/Foxboro train to South Station then transfer to an outbound train or the subway.\r\n\nAFTER 9:00 A.M: \r\nForge Park passengers should arrive 20 minutes earlier than the regularly scheduled train departure to take connecting shuttle bus service to Franklin Station for a connection with an inbound train for continued inbound service to South Station.\r\n",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "661599",
      "title": "Construction is ongoing in the Hingham Parking lot & on Shipyard Dr in preparation for the Hingham Ferry Dock upgrades. ",
      "description": null,
      "severity": 10,
      "route_id": "unknown"
    },
    {
      "id": "661398",
      "title": "Haymarket Elevator 903 (Oak Grove platform to Congress Street lobby) unavailable due to maintenance",
      "description": "To exit, take Haymarket Elevator 907 to the Orange Line underpass, then proceed to the end of the hallway and use Haymarket Elevator 906 to access the Green Line platform. At the Green Line platform, turn right and proceed to the lobby and use Haymarket Elevator 908 to access the busway. To board the Orange Line, take Haymarket Elevator 904 to the Forest Hills platform, then proceed to the end of the platform and use Haymarket Elevator 905 to access the Orange Line underpass. At the underpass, use Haymarket Elevator 907 to access the Oak Grove platform.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662392",
      "title": "All Winthrop Ferry Trips has been cancelled Mon, Aug 25. Riders can use the Rt. 712/713 bus routes & the Blue Line for alt. service.",
      "description": null,
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "635973",
      "title": "Construction is ongoing in the Hingham Parking lot & on to Shipyard Dr in preparation for the Hingham Ferry Dock upgrades.",
      "description": "There may also be pedestrian detours in the parking lot due to the construction.",
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "662272",
      "title": "As of Mon, Aug 25, further schedule adjustments will be implemented on the Fairmount Ln reflecting the progress made by Amtrak repairs",
      "description": "Planned infrastructure improvements to prepare the Fairmount Line for battery-electric trains while Amtrak repairs will continue.\r\n\nFuture adjustments to service can be expected as Amtrak makes progress on repairs, with the goal of returning to normal Commuter Rail service for passengers as soon as possible.",
      "severity": 8,
      "route_id": "unknown"
    },
    {
      "id": "577252",
      "title": "Oak Grove Escalator 105 (Commuter Rail platform to unpaid lobby) unavailable",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "428140",
      "title": "The Upper Parking Lot at Worcester Station is closed with the exception to accessible parking, due to construction.",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "580278",
      "title": "Hingham/Hull Ferry: Portions of the Town of Hull parking lot at the Hull ferry terminal are blocked off for sewer pump station construction ",
      "description": null,
      "severity": 4,
      "route_id": "unknown"
    },
    {
      "id": "661805",
      "title": "Routes 71 and 73 detoured beginning Sat Jul 19. The nearest connections are Mt Auburn St @ Mt Auburn Hospital or Mt Auburn St @ Traill St",
      "description": "Affected stops:\r\nMt Auburn St @ Longfellow Rd (outbound)\r\nMt Auburn St @ Sparks St (outbound)\r\nMt Auburn St opp Sparks St (inbound)",
      "severity": 7,
      "route_id": "unknown"
    },
    {
      "id": "662236",
      "title": "Porter Escalator 505 (Unpaid lobby to street) unavailable due to maintenance",
      "description": null,
      "severity": 3,
      "route_id": "unknown"
    },
    {
      "id": "658911",
      "title": "The Prov Ln will experience service & schedule changes. Passengers can expect delays of up to 25 minutes both ways",
      "description": null,
      "severity": 5,
      "route_id": "unknown"
    },
    {
      "id": "662013",
      "title": "Grand Union Blvd @ Foley St stop will move beginning Sun, Aug 24. Riders can board nearby at the new Assembly Sq Mobility Hub at the Cnr of ",
      "description": "Affected routes:\r\n90",
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "658552",
      "title": "Rt. 220 service will resume to & from the Hingham Ferry Terminal beginning on Sun, Aug 24. For rt. information visit mbta.com/schedules/220/",
      "description": null,
      "severity": 5,
      "route_id": "unknown"
    },
    {
      "id": "657362",
      "title": "Elev. #779 from the pedestrian bridge to the platform is temporarily out of service at East Taunton until further notice",
      "description": null,
      "severity": 1,
      "route_id": "unknown"
    },
    {
      "id": "661585",
      "title": "N Quincy Parking Lot: as of Mon, Sep 15, the parking lot located at Newport Ave will permanently close. The new parking lot located at 189 H",
      "description": "Violators will be towed at vehicle owner's expense.",
      "severity": 5,
      "route_id": "unknown"
    },
    {
      "id": "662271",
      "title": "As of Mon, Aug 25, further schedule adjustments will be implemented on the Franklin/Foxboro Ln reflecting the progress made by Amtrak repair",
      "description": "Train service will resume between Forge Park/495 station and Franklin Station, with inbound trains originating at Forge Park as previously scheduled.\r\n\nFoxboro Line trains 1765 and 1770 will now complete their trips to Foxboro Station.\r\n\nFranklin/Foxboro outbound trains will operate closer to a regular schedule with minor adjustments to allow four trains to make an additional stop at Hyde Park Station, adding approximately three minutes to the schedule and an additional five minutes to the last stop of all outbound trains.\r\n\nFranklin/Foxboro inbound trains will continue to run via the Fairmount Line and will not stop at Ruggles or Back Bay Station. An additional five minutes will be added to the last stop of some inbound evening Franklin/Foxboro trains.\r\n\nMid-day busing between Walpole and Foxboro will continue, as will the cancellation of the mid-day Foxboro trains.\r\n\nTrain 744 (1:59PM Readville) will have a minor schedule adjustment with a three-minute later departure time and three-minute later arrival time, as a result of the changes to the Franklin/Foxboro Line.\r\n\nThe Fairmount Line schedule will be adjusted to accommodate a midday Franklin/Foxboro train (train 744) running as a local via the Fairmount Line.\r\n\nShuttle buses will continue to replace service between Foxboro and Walpole on weekdays between 9:30 a.m. and 2:30 p.m. to allow for construction of a permanent, accessible platform at Foxboro Station. Special event trains for concerts and Patriots games at Gillette Stadium will continue to operate during construction.",
      "severity": 8,
      "route_id": "unknown"
    }
  ],
  "delays_by_route": {},
  "vehicle_positions": [
    {
      "id": "y3136",
      "route_id": "95",
      "route_type": null,
      "latitude": 42.38458732,
      "longitude": -71.07632037,
      "bearing": 180,
      "speed": null,
      "status": null
    },
    {
      "id": "y0764",
      "route_id": "225",
      "route_type": null,
      "latitude": 42.2527193,
      "longitude": -71.0054798,
      "bearing": 180,
      "speed": null,
      "status": null
    },
    {
      "id": "y1972",
      "route_id": "137",
      "route_type": null,
      "latitude": 42.38525396,
      "longitude": -71.07482281,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "y3329",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.4141758,
      "longitude": -70.99196131,
      "bearing": 7,
      "speed": null,
      "status": null
    },
    {
      "id": "y1312",
      "route_id": "743",
      "route_type": null,
      "latitude": 42.3515842,
      "longitude": -71.04511019,
      "bearing": 294,
      "speed": null,
      "status": null
    },
    {
      "id": "y2000",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.4022622,
      "longitude": -71.05979588,
      "bearing": 45,
      "speed": null,
      "status": null
    },
    {
      "id": "y1814",
      "route_id": "171",
      "route_type": null,
      "latitude": 42.33255984,
      "longitude": -71.056955149,
      "bearing": 358,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk316",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338529,
      "longitude": -71.043702,
      "bearing": 39,
      "speed": null,
      "status": null
    },
    {
      "id": "y1760",
      "route_id": "1",
      "route_type": null,
      "latitude": 42.34131805,
      "longitude": -71.05710214,
      "bearing": 355,
      "speed": null,
      "status": null
    },
    {
      "id": "G-10003",
      "route_id": "Green-B",
      "route_type": null,
      "latitude": 42.341,
      "longitude": -71.16742,
      "bearing": 75,
      "speed": null,
      "status": null
    },
    {
      "id": "y3357",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.41656482,
      "longitude": -71.00290982,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk252",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338804,
      "longitude": -71.044166,
      "bearing": 190,
      "speed": null,
      "status": null
    },
    {
      "id": "y0806",
      "route_id": "238",
      "route_type": null,
      "latitude": 42.22867149,
      "longitude": -71.01119187,
      "bearing": 190,
      "speed": null,
      "status": null
    },
    {
      "id": "y2067",
      "route_id": "77",
      "route_type": null,
      "latitude": 42.41646,
      "longitude": -71.15773,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "y1932",
      "route_id": "8993",
      "route_type": null,
      "latitude": 42.40114849,
      "longitude": -71.11489017,
      "bearing": 94,
      "speed": null,
      "status": null
    },
    {
      "id": "y1605",
      "route_id": "34",
      "route_type": null,
      "latitude": 42.30289,
      "longitude": -71.11017,
      "bearing": 45,
      "speed": null,
      "status": null
    },
    {
      "id": "y1634",
      "route_id": "32",
      "route_type": null,
      "latitude": 42.30289,
      "longitude": -71.11017,
      "bearing": 315,
      "speed": null,
      "status": null
    },
    {
      "id": "y2106",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.4061408,
      "longitude": -71.029637449,
      "bearing": 194,
      "speed": null,
      "status": null
    },
    {
      "id": "y3118",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.40361768,
      "longitude": -71.02995603,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk233",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338607,
      "longitude": -71.044825,
      "bearing": 212,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk223",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338774,
      "longitude": -71.044116,
      "bearing": 312,
      "speed": null,
      "status": null
    },
    {
      "id": "y1332",
      "route_id": "746",
      "route_type": null,
      "latitude": 42.33525995,
      "longitude": -71.06475003,
      "bearing": 341,
      "speed": null,
      "status": null
    },
    {
      "id": "y1325",
      "route_id": "746",
      "route_type": null,
      "latitude": 42.33051599,
      "longitude": -71.06228102,
      "bearing": 103,
      "speed": null,
      "status": null
    },
    {
      "id": "y1901",
      "route_id": "22",
      "route_type": null,
      "latitude": 42.31190288,
      "longitude": -71.05745424,
      "bearing": 190,
      "speed": null,
      "status": null
    },
    {
      "id": "y1910",
      "route_id": "10",
      "route_type": null,
      "latitude": 42.33804755,
      "longitude": -71.0365486,
      "bearing": 89,
      "speed": null,
      "status": null
    },
    {
      "id": "y1262",
      "route_id": "16",
      "route_type": null,
      "latitude": 42.32984056,
      "longitude": -71.05704612,
      "bearing": 183,
      "speed": null,
      "status": null
    },
    {
      "id": "1837",
      "route_id": "CR-Worcester",
      "route_type": null,
      "latitude": 42.27009582519531,
      "longitude": -71.64485168457031,
      "bearing": 74,
      "speed": 6.3,
      "status": null
    },
    {
      "id": "y1988",
      "route_id": "104",
      "route_type": null,
      "latitude": 42.38476655,
      "longitude": -71.07446432,
      "bearing": 210,
      "speed": null,
      "status": null
    },
    {
      "id": "y1936",
      "route_id": "110",
      "route_type": null,
      "latitude": 42.40406483,
      "longitude": -71.03104109,
      "bearing": 78,
      "speed": null,
      "status": null
    },
    {
      "id": "y3200",
      "route_id": "66",
      "route_type": null,
      "latitude": 42.34077,
      "longitude": -71.06389,
      "bearing": 45,
      "speed": null,
      "status": null
    },
    {
      "id": "y1944",
      "route_id": "104",
      "route_type": null,
      "latitude": 42.38774799,
      "longitude": -71.07328492,
      "bearing": 177,
      "speed": null,
      "status": null
    },
    {
      "id": "y3295",
      "route_id": "1",
      "route_type": null,
      "latitude": 42.33102714,
      "longitude": -71.08300255,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk226",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338938,
      "longitude": -71.044329,
      "bearing": 42,
      "speed": null,
      "status": null
    },
    {
      "id": "y1996",
      "route_id": "109",
      "route_type": null,
      "latitude": 42.38784,
      "longitude": -71.07323,
      "bearing": 135,
      "speed": null,
      "status": null
    },
    {
      "id": "y2045",
      "route_id": "71",
      "route_type": null,
      "latitude": 42.375804019,
      "longitude": -71.116178,
      "bearing": 281,
      "speed": null,
      "status": null
    },
    {
      "id": "y1318",
      "route_id": "746",
      "route_type": null,
      "latitude": 42.347212929,
      "longitude": -71.04015705,
      "bearing": 281,
      "speed": null,
      "status": null
    },
    {
      "id": "y3341",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.41306,
      "longitude": -70.99157,
      "bearing": 0,
      "speed": null,
      "status": null
    },
    {
      "id": "y0812",
      "route_id": "240",
      "route_type": null,
      "latitude": 42.1696135,
      "longitude": -71.0358758,
      "bearing": 180,
      "speed": null,
      "status": null
    },
    {
      "id": "y1648",
      "route_id": "36",
      "route_type": null,
      "latitude": 42.30282,
      "longitude": -71.11047,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "y3216",
      "route_id": "66",
      "route_type": null,
      "latitude": 42.34082,
      "longitude": -71.06412,
      "bearing": 315,
      "speed": null,
      "status": null
    },
    {
      "id": "y1804",
      "route_id": "28",
      "route_type": null,
      "latitude": 42.26747,
      "longitude": -71.09193,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "y2039",
      "route_id": "70",
      "route_type": null,
      "latitude": 42.36378,
      "longitude": -71.12297,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "y1653",
      "route_id": "24",
      "route_type": null,
      "latitude": 42.30287,
      "longitude": -71.11014,
      "bearing": 315,
      "speed": null,
      "status": null
    },
    {
      "id": "y2022",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.372323,
      "longitude": -71.060209,
      "bearing": 45,
      "speed": null,
      "status": null
    },
    {
      "id": "y1940",
      "route_id": "106",
      "route_type": null,
      "latitude": 42.38556669,
      "longitude": -71.07476009,
      "bearing": 213,
      "speed": null,
      "status": null
    },
    {
      "id": "y1928",
      "route_id": "105",
      "route_type": null,
      "latitude": 42.38765,
      "longitude": -71.07333,
      "bearing": 135,
      "speed": null,
      "status": null
    },
    {
      "id": "y3226",
      "route_id": "57",
      "route_type": null,
      "latitude": 42.35563,
      "longitude": -71.18229,
      "bearing": 180,
      "speed": null,
      "status": null
    },
    {
      "id": "y1967",
      "route_id": "73",
      "route_type": null,
      "latitude": 42.38809,
      "longitude": -71.07295,
      "bearing": 135,
      "speed": null,
      "status": null
    },
    {
      "id": "y1800",
      "route_id": "16",
      "route_type": null,
      "latitude": 42.339050129,
      "longitude": -71.05836821,
      "bearing": 94,
      "speed": null,
      "status": null
    },
    {
      "id": "y3313",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.4542,
      "longitude": -70.97529,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "1810",
      "route_id": "CR-Providence",
      "route_type": null,
      "latitude": 42.309879302978516,
      "longitude": -71.10777282714844,
      "bearing": 205,
      "speed": 28.2,
      "status": null
    },
    {
      "id": "ynk230",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338951,
      "longitude": -71.044189,
      "bearing": 254,
      "speed": null,
      "status": null
    },
    {
      "id": "y1682",
      "route_id": "31",
      "route_type": null,
      "latitude": 42.28202478,
      "longitude": -71.09233132,
      "bearing": 193,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk301",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338574,
      "longitude": -71.043844,
      "bearing": 83,
      "speed": null,
      "status": null
    },
    {
      "id": "1850",
      "route_id": "CR-NewBedford",
      "route_type": null,
      "latitude": 41.67670822143555,
      "longitude": -70.93968200683594,
      "bearing": 349,
      "speed": 9.8,
      "status": null
    },
    {
      "id": "y1998",
      "route_id": "104",
      "route_type": null,
      "latitude": 42.39311027,
      "longitude": -71.03336396,
      "bearing": 58,
      "speed": null,
      "status": null
    },
    {
      "id": "y2074",
      "route_id": "104",
      "route_type": null,
      "latitude": 42.41313216,
      "longitude": -71.0500547,
      "bearing": 219,
      "speed": null,
      "status": null
    },
    {
      "id": "y1887",
      "route_id": "23",
      "route_type": null,
      "latitude": 42.28378,
      "longitude": -71.06373,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "y3123",
      "route_id": "116",
      "route_type": null,
      "latitude": 42.393711279,
      "longitude": -71.03376942,
      "bearing": 195,
      "speed": null,
      "status": null
    },
    {
      "id": "y1922",
      "route_id": "23",
      "route_type": null,
      "latitude": 42.33113,
      "longitude": -71.06484,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "y2051",
      "route_id": "86",
      "route_type": null,
      "latitude": 42.37562,
      "longitude": -71.1154,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk234",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.33889,
      "longitude": -71.044164,
      "bearing": 63,
      "speed": null,
      "status": null
    },
    {
      "id": "y1835",
      "route_id": "15",
      "route_type": null,
      "latitude": 42.26775,
      "longitude": -71.09199,
      "bearing": 90,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk251",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338857,
      "longitude": -71.04415,
      "bearing": 47,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk235",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338772,
      "longitude": -71.044234,
      "bearing": 128,
      "speed": null,
      "status": null
    },
    {
      "id": "y1930",
      "route_id": "111",
      "route_type": null,
      "latitude": 42.38762,
      "longitude": -71.07339,
      "bearing": 135,
      "speed": null,
      "status": null
    },
    {
      "id": "y1880",
      "route_id": "16",
      "route_type": null,
      "latitude": 42.30351,
      "longitude": -71.0848,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "y1640",
      "route_id": "32",
      "route_type": null,
      "latitude": 42.2425,
      "longitude": -71.13045,
      "bearing": 225,
      "speed": null,
      "status": null
    },
    {
      "id": "1829",
      "route_id": "CR-Providence",
      "route_type": null,
      "latitude": 41.9012336730957,
      "longitude": -71.33601379394531,
      "bearing": null,
      "speed": 4.5,
      "status": null
    },
    {
      "id": "y1839",
      "route_id": "23",
      "route_type": null,
      "latitude": 42.349856,
      "longitude": -71.031481,
      "bearing": 157,
      "speed": null,
      "status": null
    },
    {
      "id": "y3354",
      "route_id": "455",
      "route_type": null,
      "latitude": 42.46269477,
      "longitude": -70.96543369,
      "bearing": 26,
      "speed": null,
      "status": null
    },
    {
      "id": "y0803",
      "route_id": "216",
      "route_type": null,
      "latitude": 42.26020748,
      "longitude": -71.00986831,
      "bearing": 270,
      "speed": null,
      "status": null
    },
    {
      "id": "ynk222",
      "route_id": "Shuttle-Generic",
      "route_type": null,
      "latitude": 42.338725,
      "longitude": -71.044542,
      "bearing": 34,
      "speed": null,
      "status": null
    },
    {
      "id": "y1615",
      "route_id": "39",
      "route_type": null,
      "latitude": 42.28101434,
      "longitude": -71.121143419,
      "bearing": 312,
      "speed": null,
      "status": null
    },
    {
      "id": "y2030",
      "route_id": "109",
      "route_type": null,
      "latitude": 42.42709004,
      "longitude": -71.03692841,
      "bearing": 64,
      "speed": null,
      "status": null
    },
    {
      "id": "y1974",
      "route_id": "109",
      "route_type": null,
      "latitude": 42.40862246,
      "longitude": -71.05405421,
      "bearing": 34,
      "speed": null,
      "status": null
    },
    {
      "id": "y2064",
      "route_id": "110",
      "route_type": null,
      "latitude": 42.38413,
      "longitude": -71.07395,
      "bearing": 180,
      "speed": null,
      "status": null
    }
  ]
}